In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "EmpID": [101,102,103,104,105,106,107,108,109,110],
    "Name": ["Arman","Riya","Kunal","Sneha","Vikram","Pooja","Rahul","Neha","Arjun","Simran"],
    "Department": ["IT","HR","IT","Finance","HR","IT","Finance","HR","IT","Finance"],
    "Salary": [60000,45000,72000,68000,50000,58000,75000,52000,40000,69000],
    "Experience": [2,1,5,4,2,3,7,2,1,6],
    "Rating": [4.5,3.8,4.9,4.2,3.5,4.0,4.8,3.9,3.2,4.6]
})

df

   EmpID    Name Department  Salary  Experience  Rating
0    101   Arman         IT   60000           2     4.5
1    102    Riya         HR   45000           1     3.8
2    103   Kunal         IT   72000           5     4.9
3    104   Sneha    Finance   68000           4     4.2
4    105  Vikram         HR   50000           2     3.5
5    106   Pooja         IT   58000           3     4.0
6    107   Rahul    Finance   75000           7     4.8
7    108    Neha         HR   52000           2     3.9
8    109   Arjun         IT   40000           1     3.2
9    110  Simran    Finance   69000           6     4.6

In [3]:
# Q1Create column Salary_Level
# salary ≥ 70000 → High
# 50000 – 69999 → Medium
# < 50000 → Low

df["Salary_Level"] = df["Salary"].apply(lambda x: "High" if x>=70000 else "low" if x<50000 else "Medium")
df

   EmpID    Name Department  Salary  Experience  Rating Salary_Level
0    101   Arman         IT   60000           2     4.5       Medium
1    102    Riya         HR   45000           1     3.8          low
2    103   Kunal         IT   72000           5     4.9         High
3    104   Sneha    Finance   68000           4     4.2       Medium
4    105  Vikram         HR   50000           2     3.5       Medium
5    106   Pooja         IT   58000           3     4.0       Medium
6    107   Rahul    Finance   75000           7     4.8         High
7    108    Neha         HR   52000           2     3.9       Medium
8    109   Arjun         IT   40000           1     3.2          low
9    110  Simran    Finance   69000           6     4.6       Medium

In [4]:
# Create Bonus column
#  Bonus = 12% Salary
df["Bonus"] = df["Salary"].apply(lambda x: x*0.12)
df

   EmpID    Name Department  Salary  Experience  Rating Salary_Level   Bonus
0    101   Arman         IT   60000           2     4.5       Medium  7200.0
1    102    Riya         HR   45000           1     3.8          low  5400.0
2    103   Kunal         IT   72000           5     4.9         High  8640.0
3    104   Sneha    Finance   68000           4     4.2       Medium  8160.0
4    105  Vikram         HR   50000           2     3.5       Medium  6000.0
5    106   Pooja         IT   58000           3     4.0       Medium  6960.0
6    107   Rahul    Finance   75000           7     4.8         High  9000.0
7    108    Neha         HR   52000           2     3.9       Medium  6240.0
8    109   Arjun         IT   40000           1     3.2          low  4800.0
9    110  Simran    Finance   69000           6     4.6       Medium  8280.0

In [5]:
# Create Experience_Level
# Experience ≥ 5 → Senior
# 2 – 4 → Mid
# < 2 → Junior

df["Experience_Level"] = df["Experience"].apply(lambda x: "Senior" if x>=5 else "Junior" if x<2 else "Mid")
df

,EmpID,Name,Department,Salary,Experience,Rating,Salary_Level,Bonus,Experience_Level
0,101,Arman,IT,60000,2,4.5,Medium,7200.0,Mid
1,102,Riya,HR,45000,1,3.8,low,5400.0,Junior
2,103,Kunal,IT,72000,5,4.9,High,8640.0,Senior
3,104,Sneha,Finance,68000,4,4.2,Medium,8160.0,Mid
4,105,Vikram,HR,50000,2,3.5,Medium,6000.0,Mid
5,106,Pooja,IT,58000,3,4.0,Medium,6960.0,Mid
6,107,Rahul,Finance,75000,7,4.8,High,9000.0,Senior
7,108,Neha,HR,52000,2,3.9,Medium,6240.0,Mid
8,109,Arjun,IT,40000,1,3.2,low,4800.0,Junior
9,110,Simran,Finance,69000,6,4.6,Medium,8280.0,Senior

In [6]:
# Create Performance column

# Rating ≥ 4.5 → Excellent
# 4 – 4.49 → Good
# else → Average

df["Performance"] = df["Rating"].apply(lambda x: "Excellent" if x>=4.5 else "Average" if x<4 else "Good")
df

,EmpID,Name,Department,Salary,Experience,Rating,Salary_Level,Bonus,Experience_Level,Performance
0,101,Arman,IT,60000,2,4.5,Medium,7200.0,Mid,Excellent
1,102,Riya,HR,45000,1,3.8,low,5400.0,Junior,Average
2,103,Kunal,IT,72000,5,4.9,High,8640.0,Senior,Excellent
3,104,Sneha,Finance,68000,4,4.2,Medium,8160.0,Mid,Good
4,105,Vikram,HR,50000,2,3.5,Medium,6000.0,Mid,Average
5,106,Pooja,IT,58000,3,4.0,Medium,6960.0,Mid,Good
6,107,Rahul,Finance,75000,7,4.8,High,9000.0,Senior,Excellent
7,108,Neha,HR,52000,2,3.9,Medium,6240.0,Mid,Average
8,109,Arjun,IT,40000,1,3.2,low,4800.0,Junior,Average
9,110,Simran,Finance,69000,6,4.6,Medium,8280.0,Senior,Excellent

In [7]:
# IT employees → Salary increase 10%
df["New_Salary"] = df["Salary"].apply(lambda x: x*1.10)
df

,EmpID,Name,Department,Salary,Experience,Rating,Salary_Level,Bonus,Experience_Level,Performance,New_Salary
0,101,Arman,IT,60000,2,4.5,Medium,7200.0,Mid,Excellent,66000.0
1,102,Riya,HR,45000,1,3.8,low,5400.0,Junior,Average,49500.0
2,103,Kunal,IT,72000,5,4.9,High,8640.0,Senior,Excellent,79200.0
3,104,Sneha,Finance,68000,4,4.2,Medium,8160.0,Mid,Good,74800.0
4,105,Vikram,HR,50000,2,3.5,Medium,6000.0,Mid,Average,55000.0
5,106,Pooja,IT,58000,3,4.0,Medium,6960.0,Mid,Good,63800.0
6,107,Rahul,Finance,75000,7,4.8,High,9000.0,Senior,Excellent,82500.0
7,108,Neha,HR,52000,2,3.9,Medium,6240.0,Mid,Average,57200.0
8,109,Arjun,IT,40000,1,3.2,low,4800.0,Junior,Average,44000.0
9,110,Simran,Finance,69000,6,4.6,Medium,8280.0,Senior,Excellent,75900.0

In [9]:
# Create Tax column

# IT → 10% Salary
# HR → 8% Salary
# Finance → 12% Salary
df["Tax"] = df.apply(lambda row: row["Salary"]*0.10 if row["Department"] == "IT" else row["Salary"]*0.08 if row["Department"] == "HR" else row["Salary"]*0.12,axis=1)
df

,EmpID,Name,Department,Salary,Experience,Rating,Salary_Level,Bonus,Experience_Level,Performance,New_Salary,Tax
0,101,Arman,IT,60000,2,4.5,Medium,7200.0,Mid,Excellent,66000.0,6000.0
1,102,Riya,HR,45000,1,3.8,low,5400.0,Junior,Average,49500.0,3600.0
2,103,Kunal,IT,72000,5,4.9,High,8640.0,Senior,Excellent,79200.0,7200.0
3,104,Sneha,Finance,68000,4,4.2,Medium,8160.0,Mid,Good,74800.0,8160.0
4,105,Vikram,HR,50000,2,3.5,Medium,6000.0,Mid,Average,55000.0,4000.0
5,106,Pooja,IT,58000,3,4.0,Medium,6960.0,Mid,Good,63800.0,5800.0
6,107,Rahul,Finance,75000,7,4.8,High,9000.0,Senior,Excellent,82500.0,9000.0
7,108,Neha,HR,52000,2,3.9,Medium,6240.0,Mid,Average,57200.0,4160.0
8,109,Arjun,IT,40000,1,3.2,low,4800.0,Junior,Average,44000.0,4000.0
9,110,Simran,Finance,69000,6,4.6,Medium,8280.0,Senior,Excellent,75900.0,8280.0

In [11]:
# Average salary per department
avg_salary = df.groupby("Department")["Salary"].mean().reset_index()
avg_salary

  Department        Salary
0    Finance  70666.666667
1         HR  49000.000000
2         IT  57500.000000

In [18]:
# Top 3 highest paid employees
df.sort_values("Salary",ascending=False).head(3)[
    ["EmpID", "Department", "Salary"]
]

   EmpID Department  Salary
6    107    Finance   75000
2    103         IT   72000
9    110    Finance   69000

In [25]:
# Employees whose salary > department average
df[df["Salary"] > df.groupby("Department")["Salary"].transform("mean")][
    ["Name","Salary","Department"]
]

     Name  Salary Department
0   Arman   60000         IT
2   Kunal   72000         IT
4  Vikram   50000         HR
5   Pooja   58000         IT
6   Rahul   75000    Finance
7    Neha   52000         HR

In [28]:
# Create Risk column
# Rating < 3.5 → High Risk
# 3.5 – 4 → Medium Risk
# > 4 → Low Risk
df["Risk"] = df["Rating"].apply(lambda x: "High Risk" if x<3.5 else "Low risk" if x>4 else "Medium Risk")
df

,EmpID,Name,Department,Salary,Experience,Rating,Salary_Level,Bonus,Experience_Level,Performance,New_Salary,Tax,Risk
0,101,Arman,IT,60000,2,4.5,Medium,7200.0,Mid,Excellent,66000.0,6000.0,Low risk
1,102,Riya,HR,45000,1,3.8,low,5400.0,Junior,Average,49500.0,3600.0,Medium Risk
2,103,Kunal,IT,72000,5,4.9,High,8640.0,Senior,Excellent,79200.0,7200.0,Low risk
3,104,Sneha,Finance,68000,4,4.2,Medium,8160.0,Mid,Good,74800.0,8160.0,Low risk
4,105,Vikram,HR,50000,2,3.5,Medium,6000.0,Mid,Average,55000.0,4000.0,Medium Risk
5,106,Pooja,IT,58000,3,4.0,Medium,6960.0,Mid,Good,63800.0,5800.0,Medium Risk
6,107,Rahul,Finance,75000,7,4.8,High,9000.0,Senior,Excellent,82500.0,9000.0,Low risk
7,108,Neha,HR,52000,2,3.9,Medium,6240.0,Mid,Average,57200.0,4160.0,Medium Risk
8,109,Arjun,IT,40000,1,3.2,low,4800.0,Junior,Average,44000.0,4000.0,High Risk
9,110,Simran,Finance,69000,6,4.6,Medium,8280.0,Senior,Excellent,75900.0,8280.0,Low risk

In [41]:
# Find:
# Department with highest average rating
# df.groupby("Department")["Rating"].mean().sort_values(ascending=False)
df.groupby("Department")["Rating"].mean().idxmax()

'Finance'

In [44]:
# Create Promotion column
# Eligible if:
# ✔ Experience ≥ 4
# ✔ Rating ≥ 4.5
# ✔ Salary < 70000
# Else → Not Eligible

df["Promotion"] = np.where(
    (df["Experience"]>=4) & (df["Rating"]>=4.5) & (df["Salary"]<70000),
    "Eligible","Not Eligible"
)
    
df
# alternative 
# df["Promotion"] = df.apply(
#     lambda row: "Eligible"
#     if (row["Experience"] >= 4 and row["Rating"] >= 4.5 and row["Salary"] < 70000)
#     else "Not Eligible",
#     axis=1)


# df["Promotion"] = "Not Eligible"

# df.loc[
#     (df["Experience"] >= 4) &
#     (df["Rating"] >= 4.5) &
#     (df["Salary"] < 70000),
#     "Promotion"
# ] = "Eligible"

,EmpID,Name,Department,Salary,Experience,Rating,Salary_Level,Bonus,Experience_Level,Performance,New_Salary,Tax,Risk,Promotion
0,101,Arman,IT,60000,2,4.5,Medium,7200.0,Mid,Excellent,66000.0,6000.0,Low risk,Not Eligible
1,102,Riya,HR,45000,1,3.8,low,5400.0,Junior,Average,49500.0,3600.0,Medium Risk,Not Eligible
2,103,Kunal,IT,72000,5,4.9,High,8640.0,Senior,Excellent,79200.0,7200.0,Low risk,Not Eligible
3,104,Sneha,Finance,68000,4,4.2,Medium,8160.0,Mid,Good,74800.0,8160.0,Low risk,Not Eligible
4,105,Vikram,HR,50000,2,3.5,Medium,6000.0,Mid,Average,55000.0,4000.0,Medium Risk,Not Eligible
5,106,Pooja,IT,58000,3,4.0,Medium,6960.0,Mid,Good,63800.0,5800.0,Medium Risk,Not Eligible
6,107,Rahul,Finance,75000,7,4.8,High,9000.0,Senior,Excellent,82500.0,9000.0,Low risk,Not Eligible
7,108,Neha,HR,52000,2,3.9,Medium,6240.0,Mid,Average,57200.0,4160.0,Medium Risk,Not Eligible
8,109,Arjun,IT,40000,1,3.2,low,4800.0,Junior,Average,44000.0,4000.0,High Risk,Not Eligible
9,110,Simran,Finance,69000,6,4.6,Medium,8280.0,Senior,Excellent,75900.0,8280.0,Low risk,Eligible

In [46]:
# Find:
# Total salary company spends per department

total_salary_deptwise = df.groupby("Department")["Salary"].sum()
total_salary_deptwise

Department
Finance    212000
HR         147000
IT         230000
Name: Salary, dtype: int64

In [ ]:
# Alternatives
# df.groupby("Department")["Salary"].sum().reset_index()

  Department  Salary
0    Finance  212000
1         HR  147000
2         IT  230000